app/views/budgets/edit.html.erb

SELECT "budget_items".* FROM "budget_items" WHERE "budget_items"."budget_id" = 1
---
  <script>
    document.addEventListener('DOMContentLoaded', function() {
      let incomeIndex = <%= @budget.budget_items.select { |i| i.item_type == 'income' }.size || 0 %>;
      let expenseIndex = <%= @budget.budget_items.select { |i| i.item_type == 'expense' }.size || 0 %>;

      document.getElementById('add-income')?.addEventListener('click', function() {
        const container = document.getElementById('income-items');
        // Calculate next position
        const currentCount = container.querySelectorAll('.nested-fields').length;
        const nextPosition = currentCount + 1;

        const html = `
          <div class="card mb-3 income-item nested-fields">
            <div class="card-header drag-handle" style="cursor: move;">
              <span class="text-muted">☰ Reordenar</span>
            </div>
            <div class="card-body">
              <div class="row">
                <div class="col-md-4">
                  <input type="text" name="budget[budget_items_attributes][${incomeIndex}][name]" class="form-control" placeholder="Nombre del ingreso" />
                </div>
                <div class="col-md-4">