app/views/budgets/show.html.erb

SELECT "budget_items".* FROM "budget_items" WHERE "budget_items"."budget_id" = 1
---
        <ul class="list-group list-group-flush">
          <% @budget.budget_items.select { |item| item.item_type == 'income' }.each do |item| %>