app/views/balance_sheets/edit.html.erb

                      <option value=""><%= I18n.t('views.common.select_prompt') %></option>
                      <% Asset.translated_item_types.each do |label, value| %>
---
SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1

                      <option value=""><%= I18n.t('views.common.select_prompt') %></option>
                      <% Liability.translated_item_types.each do |label, value| %>
---
SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1