app/views/balance_sheets/report.html.erb

SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1
---

<% liquid_assets_list = @balance_sheet.assets.select { |a| a.item_type == 'liquid' } %>

SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1
---

<% if @balance_sheet.assets.any? || @balance_sheet.liabilities.any? %>