app/cells/balance_sheet_cell.rb

  def liquid_assets
    balance_sheet.assets.select { |a| a.item_type == "liquid" }
---
SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1

  def short_term_liabilities
    balance_sheet.liabilities.select { |l| l.item_type == "short_term" }
---
SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1