app/controllers/accounts_controller.rb

  def index
    @accounts = current_user.accounts.order(created_at: :desc)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 ORDER BY "accounts"."created_at" DESC

  def show
    @balance_sheets = @account.balance_sheets.latest.limit(5)
    @budgets = @account.budgets.order(start_date: :desc).limit(5)
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."account_id" = 1 ORDER BY "budgets"."start_date" DESC LIMIT 5

  def create
    @account = current_user.accounts.build(account_params)

    if @account.save
---
INSERT INTO "accounts" ("user_id", "name", "account_type", "description", "created_at", "updated_at") VALUES (1, 'Efectivo', 'checking', '', '2026-01-10 20:45:08.415817', '2026-01-10 20:45:08.415817') RETURNING "id"

  def update
    if @account.update(account_params)
---
UPDATE "accounts" SET "name" = 'Santiago', "description" = 'Esto es una prueba colocando mis montos reales para organizar mis finanzas. Realmente, pienso en escalarlo a tener la posibilidad de que más personas organicen su hogar', "updated_at" = '2026-01-10 22:04:26.381587' WHERE "accounts"."id" = 1

  def set_account
    @account = current_user.accounts.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."id" = 1 LIMIT 1