app/controllers/balance_sheets_controller.rb

  def set_balance_sheet
    @balance_sheet = current_user.balance_sheets.find(params[:id])
---
SELECT "balance_sheets".* FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1 AND "balance_sheets"."id" = 1 LIMIT 1

  def set_account
    @account = current_user.accounts.find(params[:account_id]) if params[:account_id].present?
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."id" = 1 LIMIT 1