app/controllers/balance_sheets_controller.rb

SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1
SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1
---
  def index
    @balance_sheets = current_user.balance_sheets.includes(:account, :assets, :liabilities)
                                   .latest

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."id" = 1 LIMIT 1
---
  def new
    @balance_sheet = current_user.balance_sheets.build
    @balance_sheet.account = @account if @account
    @balance_sheet.recorded_at = Time.current
    @balance_sheet.assets.build if @balance_sheet.assets.empty?

INSERT INTO "balance_sheets" ("user_id", "account_id", "recorded_at", "total_assets", "total_liabilities", "net_worth", "notes", "created_at", "updated_at") VALUES (1, 1, '2026-01-10 20:55:00', 0.0, 0.0, 0.0, '', '2026-01-10 20:59:21.418407', '2026-01-10 20:59:21.418407') RETURNING "id"
---
  def create
    @balance_sheet = current_user.balance_sheets.build(balance_sheet_params)
    set_account_from_params
    @balance_sheet.recorded_at = parse_recorded_at || Time.current

    if @balance_sheet.save

SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1
SELECT 1 AS one FROM "assets" WHERE "assets"."balance_sheet_id" = 1 LIMIT 1
SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1 AND "assets"."id" IN (1, 2, 3, 4)
SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1 AND "liabilities"."id" IN (1, 2)
SELECT 1 AS one FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1 LIMIT 1
---
  def edit
    @balance_sheet.assets.build if @balance_sheet.assets.empty?
    @balance_sheet.liabilities.build if @balance_sheet.liabilities.empty?

UPDATE "balance_sheets" SET "total_assets" = 14938554.55, "total_liabilities" = 2630109.0, "net_worth" = 12308445.55, "updated_at" = '2026-01-10 21:09:09.509697' WHERE "balance_sheets"."id" = 1
---
  def update
    @balance_sheet.assign_attributes(balance_sheet_params)
    set_account_from_params
    parsed_time = parse_recorded_at
    @balance_sheet.recorded_at = parsed_time if parsed_time
    if @balance_sheet.save

SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1 AND "assets"."id" IN (1, 2, 3, 4)
SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1 AND "liabilities"."id" IN (1, 2)
---
    scope = scope.includes(:assets, :liabilities) if action_name.in?(ACTIONS_WITH_ITEMS)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
---
  def set_account
    @account = current_user.accounts.find(params[:account_id]) if params[:account_id].present?

SELECT "balance_sheets".* FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1 AND "balance_sheets"."id" = 1 LIMIT 1
---
  def set_account_from_params
    if params[:balance_sheet][:account_id].present?
      @balance_sheet.account = current_user.accounts.find_by(id: params[:balance_sheet][:account_id])