app/controllers/budgets_controller.rb

SELECT "budgets".* FROM "budgets" WHERE "budgets"."user_id" = 1 ORDER BY "budgets"."start_date" DESC
---
  def index
    @budgets = current_user.budgets.includes(:account, :budget_items)
                           .order(start_date: :desc)

INSERT INTO "budgets" ("user_id", "account_id", "name", "periodicity", "start_date", "end_date", "total_income", "total_expenses", "free_cash_flow", "created_at", "updated_at") VALUES (1, 1, 'Presupuesto 2026', 'monthly', '2026-01-01', '2026-01-31', 12500000.0, 11537205.0, 962795.0, '2026-01-10 22:46:14.211073', '2026-01-10 22:46:14.211073') RETURNING "id"
---
  def create
    @budget = current_user.budgets.build(budget_params)
    set_account_from_params

    if @budget.save

SELECT "budget_items".* FROM "budget_items" WHERE "budget_items"."budget_id" = 1 AND "budget_items"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22)
---
  def edit
    @budget.budget_items.build(item_type: "income") if @budget.budget_items.select { |item| item.item_type == "income" }.empty?

UPDATE "budgets" SET "total_income" = 13200000.0, "total_expenses" = 12037205.0, "free_cash_flow" = 1162795.0, "updated_at" = '2026-01-10 22:51:15.769656' WHERE "budgets"."id" = 1
---
  def update
    @budget.assign_attributes(budget_params)
    set_account_from_params
    if @budget.save

SELECT "budgets".* FROM "budgets" WHERE "budgets"."user_id" = 1 AND "budgets"."id" = 1 LIMIT 1
---
  def set_budget
    @budget = current_user.budgets.find(params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."id" = 1 LIMIT 1
---
  def set_account
    @account = current_user.accounts.find(params[:account_id]) if params[:account_id].present?