app/controllers/dashboard_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 LIMIT 5
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = 1
SELECT "budgets".* FROM "budgets" WHERE "budgets"."user_id" = 1 ORDER BY "budgets"."start_date" DESC LIMIT 3
SELECT COUNT(*) FROM "budgets" WHERE "budgets"."user_id" = 1
SELECT COUNT(*) FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1
SELECT "balance_sheets".* FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1 AND (recorded_at < '2026-01-10 22:30:00') ORDER BY "balance_sheets"."recorded_at" DESC LIMIT 1
---
  def index
    @accounts = current_user.accounts.limit(5)
    @latest_balance_sheet = current_user.balance_sheets.latest.first
    @latest_budgets = current_user.budgets.order(start_date: :desc).limit(3)
    @latest_savings_plans = current_user.savings_plans.order(created_at: :desc).limit(3)

    @total_accounts = current_user.accounts.count
    @total_balance_sheets = current_user.balance_sheets.count
    @total_budgets = current_user.budgets.count
    @total_savings_plans = current_user.savings_plans.count

    if @latest_balance_sheet
      @current_net_worth = @latest_balance_sheet.net_worth
      @previous_balance_sheet = current_user.balance_sheets.where("recorded_at < ?", @latest_balance_sheet.recorded_at).latest.first