app/controllers/reports_controller.rb

  def balance_sheet
    @account_id = params[:account_id]
    @start_date = params[:start_date].presence
    @end_date = params[:end_date].presence

    @balance_sheets = current_user.balance_sheets.includes(:account, :assets, :liabilities)
                                   .latest

    @balance_sheets = @balance_sheets.by_account(@account_id) if @account_id.present?

    if @start_date.present?
      @balance_sheets = @balance_sheets.where('recorded_at >= ?', Date.parse(@start_date))
    end

    if @end_date.present?
      @balance_sheets = @balance_sheets.where('recorded_at <= ?', Date.parse(@end_date).end_of_day)
    end

    @accounts = current_user.accounts.order(:name)
    @total_net_worth = @balance_sheets.sum(:net_worth)
    @average_net_worth = @balance_sheets.count > 0 ? @total_net_worth / @balance_sheets.count : 0
---
SELECT "assets".* FROM "assets" WHERE "assets"."balance_sheet_id" = 1
SELECT "liabilities".* FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1
SELECT COUNT(*) FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1
SELECT 1 AS one FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1 LIMIT 1
SELECT "balance_sheets".* FROM "balance_sheets" WHERE "balance_sheets"."user_id" = 1 ORDER BY "balance_sheets"."recorded_at" DESC
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 ORDER BY "accounts"."name" ASC
SELECT SUM("balance_sheets"."net_worth") FROM "balance_sheets" LEFT OUTER JOIN "accounts" ON "accounts"."id" = "balance_sheets"."account_id" LEFT OUTER JOIN "assets" ON "assets"."balance_sheet_id" = "balance_sheets"."id" LEFT OUTER JOIN "liabilities" ON "liabilities"."balance_sheet_id" = "balance_sheets"."id" WHERE "balance_sheets"."user_id" = 1