app/models/balance_sheet.rb

  def calculate_totals
    self.total_assets = assets.sum(:amount) || 0.0
    self.total_liabilities = liabilities.sum(:amount) || 0.0
---
SELECT SUM("assets"."amount") FROM "assets" WHERE "assets"."balance_sheet_id" = 1
SELECT SUM("liabilities"."amount") FROM "liabilities" WHERE "liabilities"."balance_sheet_id" = 1